pmorgantech/WaveX/firmware/esp32/sdkconfig.defaults
    # This file was generated using idf.py save-defconfig. It can be edited manually.
    # Espressif IoT Development Framework (ESP-IDF) 5.5.1 Project Minimal Configuration
    #
    # default:
CONFIG_IDF_TARGET="esp32p4"
CONFIG_BOOTLOADER_LOG_LEVEL_WARN=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_HEADER_FLASHSIZE_UPDATE=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_DISABLE=y
CONFIG_SPI_MASTER_IN_IRAM=y
CONFIG_DMA2D_OPERATION_FUNC_IN_IRAM=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y
CONFIG_ESP_SYSTEM_PANIC_PRINT_HALT=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=32768
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
CONFIG_ESP_INT_WDT_TIMEOUT_MS=5000
CONFIG_ESP_TASK_WDT_INIT=n
CONFIG_FREERTOS_HZ=1000
CONFIG_LWIP_MAX_SOCKETS=4
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=16
CONFIG_MBEDTLS_TLS_DISABLED=y
CONFIG_VFS_MAX_COUNT=4
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_22=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_32=y
CONFIG_LV_FONT_MONTSERRAT_36=y
CONFIG_BSP_LCD_DPI_BUFFER_NUMS=3
CONFIG_BSP_LCD_TYPE_720_1280_5_INCH_A=y
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_LVGL_PORT_ENABLE_PPA=y

# USB MIDI device class (roadmap Phase 1 item 8)
CONFIG_TINYUSB_MIDI_COUNT=1

# LVGL snapshot support (ui_screenshot.cpp, debug builds)
CONFIG_LV_USE_SNAPSHOT=y

# Picolibc instead of Newlib. Smaller image and, more usefully here, lower
# per-task stack and heap-allocation overhead on stdio paths - internal DMA
# heap is the scarce resource on this board (see display_manager's heap
# telemetry). Available from IDF v5.0 and the default from v6.0, so this also
# de-risks that upgrade. Safe for this project: nothing here touches
# "struct _reent" or redirects stdin/stdout/stderr per task, and no prebuilt
# library in the dependency tree targets RISC-V (the NemaGFX and zl38063
# archives are ARM/codec blobs that never link on ESP32-P4), so the
# LIBC_PICOLIBC_NEWLIB_COMPATIBILITY caveats do not apply. Revert with
# CONFIG_LIBC_NEWLIB=y if stdio behaviour ever looks wrong.
CONFIG_LIBC_PICOLIBC=y
